#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Загрузить ТД из временного хранилища
//
// Параметры:
//  Адрес  - Строка - адрес во временном хранилище
//
// Возвращаемое значение:
//   (нет)
//
Функция ПрочитатьПомещенныйФайл(Знач Адрес) Экспорт
	ПMXL_ТабличныйДокумент_ПрочитатьИзВременногоХранилища(ЭтотОбъект.ТабличныйДокумент,Адрес);
	ПMXL_ТабличныйДокумент_ВключитьПоказРасшифровки(ЭтотОбъект.ТабличныйДокумент);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	Перем ПараметрыРегистрации, Команда;
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "Форма";
	Команда.Представление = ЭтотОбъект.Метаданные().Представление();
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Прочитать из временного хранилища
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент
//  Адрес				 - Строка - адрес во временном хранилище
//
Процедура ПMXL_ТабличныйДокумент_ПрочитатьИзВременногоХранилища(Знач ТабличныйДокумент, Знач Адрес) Экспорт
	Перем Поток;

	Поток = ПолучитьИзВременногоХранилища(Адрес).ОткрытьПотокДляЧтения();
    ТабличныйДокумент.Прочитать(Поток);  
    Поток.Закрыть();

КонецПроцедуры

// Заблокировать ТД от изменения, чтобы показывалась расшифровка
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент
//
Процедура ПMXL_ТабличныйДокумент_ВключитьПоказРасшифровки(Знач ТабличныйДокумент) Экспорт
	// Информация в "Методические рекомендации по конфигурированию" (https://its.1c.ru/db/metod8dev/content/2233/hdoc) неверна,
	// ТолькоПросмотр на показ расшифровки не влияет.
	// "Защита" всего документа тоже не влияет.
	// Влияет только "Защита" отдельных ячеек
	Для Строка = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Для Столбец = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			ТабличныйДокумент.Область(Строка,Столбец).Защита = Истина;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти