#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьКоманду("Открыть");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрыть(Команда)
	Перем ПараметрыДиалога, Оповещение;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов(,Ложь,НСтр("ru = 'Табличный документ'")+" (*.mxl)|*.mxl");
	Оповещение = Новый ОписаниеОповещения("КомандаОткрытьЗавершение",
										  ЭтотОбъект);										  
	НачатьПомещениеФайлаНаСервер(Оповещение,,,,ПараметрыДиалога,ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

#Область Вспомогательные

&НаКлиенте
Процедура КомандаОткрытьЗавершение(ОписаниеПомещенногоФайла, _) Экспорт
	Если ОписаниеПомещенногоФайла = Неопределено Тогда Возврат; КонецЕсли;
	
	ВызватьМетодОбъекта("ПрочитатьПомещенныйФайл",
						ЗначениеВМассиве(ОписаниеПомещенногоФайла.Адрес),
						Истина);
	ЭтотОбъект.Заголовок = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполнить команду формы
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения
//  Имя  - Строка
//
&НаКлиенте
Процедура ВыполнитьКоманду(Знач Имя) Экспорт
	Перем Команда;
	
	Команда = ЭтотОбъект.Команды.Найти(Имя);
	Выполнить(Команда.Действие+"(Команда)");
КонецПроцедуры

// Вызвать метод объекта без необходимости создавать отдельную подпрограмму на каждый конкретный случай
//
// Параметры:
//  ИмяМетода		 - Строка
//  Параметры		 - Массив[Произвольный]
//  ИзменяетДанные	 - Булево
// 
// Возвращаемое значение:
//   Произвольный
//
&НаСервере
Функция ВызватьМетодОбъекта(Знач ИмяМетода, Знач Параметры=Неопределено, ИзменяетДанные=Ложь)
    Перем Объект_, Результат;
    Объект_ = РеквизитФормыВЗначение("Объект");
    Результат = ОбщегоНазначения.ВызватьФункциюОбъекта(Объект_,ИмяМетода,Параметры);
    Если ИзменяетДанные Тогда
        ЗначениеВРеквизитФормы(Объект_,"Объект");
    КонецЕсли;
    Возврат Результат;
КонецФункции

// Обернуть значение в массив
//
// Параметры:
//  Значение - Произвольный
// 
// Возвращаемое значение:
//   Массив[произвольный]
//
&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	Перем Результат;
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
КонецФункции

#КонецОбласти